## Plan Result (sbox_shutter_static_webapp)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;toffee2&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;toffee2&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;toffee2&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;toffee2&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;toffee2&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["toffee2"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee2-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["toffee2"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.toffee2"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["toffee2"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "toffee2"
      + resource_group_name = "sds-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["toffee2"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "toffee2.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["toffee2"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "toffee2_sbox"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        {
            backend_domain   = [
                "firewall-sbox-int-palo-sdssbox.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-sandbox-platform-hmcts-net"
            custom_domain    = "toffee.sandbox.platform.hmcts.net"
            disabled_rules   = {}
            dns_zone_name    = "sandbox.platform.hmcts.net"
            name             = "toffee"
            shutter_app      = true
        },
      + {
          + add_txt_record   = true
          + backend_domain   = [
              + "firewall-sbox-int-palo-sdssbox.uksouth.cloudapp.azure.com",
            ]
          + certificate_name = "wildcard-sandbox-platform-hmcts-net"
          + custom_domain    = "toffee2.sandbox.platform.hmcts.net"
          + disabled_rules   = {}
          + dns_zone_name    = "sandbox.platform.hmcts.net"
          + name             = "toffee2"
          + shutter_app      = true
        },
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":613,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_static_webapp","Vars":{}} -->